{
  "PLAINS": [
    {
      "id": "plains_wild_dog_pack",
      "title": "Branco di Cani Selvatici",
      "description": "Un branco di cani randagi ti blocca la strada. Sembrano affamati e aggressivi.",
      "choices": [
        {
          "text": "Combatti",
          "skillCheck": { "stat": "forza", "difficulty": 12 },
          "successText": "Riesci a scacciare il branco senza ferite gravi.",
          "failureText": "I cani ti feriscono prima di fuggire.",
          "penalty": { "type": "damage", "amount": 15 }
        },
        {
          "text": "Offri del cibo",
          "skillCheck": { "stat": "carisma", "difficulty": 10 },
          "successText": "I cani accettano il cibo e si allontanano pacificamente.",
          "failureText": "I cani prendono il cibo ma rimangono aggressivi.",
          "items_lost": [{ "id": "ration_pack", "quantity": 1 }]
        }
      ]
    },
    {
      "id": "plains_old_scarecrow",
      "title": "Vecchio Spaventapasseri",
      "description": "In mezzo a un campo arido, noti uno spaventapasseri solitario. La sua figura contorta sembra quasi umana. Potrebbe nascondere qualcosa di utile o essere una trappola.",
      "choices": [
        {
          "text": "Ispeziona con cautela",
          "skillCheck": { "stat": "intelligenza", "difficulty": 11 },
          "successText": "Analizzando la struttura, noti un piccolo scomparto nascosto alla base. Dentro, trovi delle bende pulite e un pacchetto di fiammiferi.",
          "failureText": "È solo un ammasso di stracci e paglia fradicia. Mentre frughi, un nido di insetti mutati ti assale, lasciandoti con qualche fastidiosa puntura.",
          "items_gained": [{ "id": "bandages_clean", "quantity": 1 }, { "id": "matches", "quantity": 1 }],
          "penalty": { "type": "damage", "amount": 3 }
        },
        {
          "text": "Ignoralo e prosegui",
          "actionKey": "ignore",
          "resultText": "Decidi che non vale la pena rischiare. Prosegui il tuo cammino, lasciandoti alle spalle la figura solitaria nel vento."
        }
      ]
    },
    {
      "id": "plains_abandoned_vehicle",
      "title": "Veicolo Abbandonato",
      "description": "La carcassa arrugginita di un'auto è ferma sul ciglio di quella che un tempo era una strada. Il bagagliaio sembra chiuso ermeticamente.",
      "choices": [
        {
          "text": "Forza il bagagliaio",
          "skillCheck": { "stat": "forza", "difficulty": 13 },
          "successText": "Con uno sforzo immane, riesci a scardinare il bagagliaio. Dentro, trovi dei rottami metallici e una tanica con un po' di carburante.",
          "failureText": "Il meccanismo è saldato dalla ruggine. Non riesci ad aprirlo e lo sforzo ti lascia senza fiato e con una fitta alla schiena.",
          "items_gained": [{ "id": "scrap_metal", "quantity": 3 }, { "id": "fuel_canister_small", "quantity": 1 }],
          "penalty": { "type": "status", "status": "WOUNDED" }
        },
        {
          "text": "Controlla l'abitacolo",
          "skillCheck": { "stat": "intelligenza", "difficulty": 10 },
          "successText": "Nel vano portaoggetti, dietro a carte ammuffite, trovi una vecchia mappa stradale della regione. Potrebbe rivelarsi preziosa.",
          "failureText": "L'interno è stato completamente saccheggiato e vandalizzato. Non c'è rimasto assolutamente nulla di valore.",
          "items_gained": [{ "id": "old_military_map", "quantity": 1 }]
        }
      ]
    },
    {
      "id": "plains_strange_carcass",
      "title": "Carcassa Misteriosa",
      "description": "Vedi una carcassa di una creatura che non riconosci. È enorme, non assomiglia a nessun animale che tu abbia mai visto. Potrebbe essere una fonte di cibo o un nido di malattie.",
      "choices": [
        {
          "text": "Recupera carne con cautela",
          "skillCheck": { "stat": "intelligenza", "difficulty": 12 },
          "successText": "Analizzando la carcassa, noti che la carne vicino alle ossa è ancora buona e non sembra contaminata. Recuperi un bel pezzo.",
          "failureText": "Mentre tagli la carne, liberi una sacca di gas putridi. L'odore nauseabondo ti investe e ti senti subito male.",
          "items_gained": [{ "id": "meat_raw", "quantity": 3 }],
          "penalty": { "type": "status", "status": "SICK" }
        },
        {
          "text": "Mantieni le distanze",
          "actionKey": "ignore",
          "resultText": "L'istinto ti dice che il rischio è troppo alto. Prosegui, lasciando che la natura faccia il suo corso."
        }
      ]
    },
    {
      "id": "plains_memorial_forgotten",
      "title": "Monumento Dimenticato",
      "description": "Trovi una piccola lapide di pietra grezza, incisa rozzamente. Dice: 'Hanno combattuto per un domani che non hanno mai visto'. Alla base, qualcuno ha lasciato un piccolo oggetto avvolto in un panno.",
      "choices": [
        {
          "text": "Prendi l'oggetto",
          "resultText": "Con rispetto, prendi l'offerta. È una bussola funzionante. Chiunque l'abbia lasciata voleva che aiutasse un altro viaggiatore.",
          "items_gained": [{ "id": "fathers_compass", "quantity": 1 }]
        },
        {
          "text": "Lascia una tua razione in segno di rispetto",
          "skillCheck": { "stat": "carisma", "difficulty": 8 },
          "successText": "Decidi di onorare il loro sacrificio. Lasci una delle tue razioni. Questo semplice gesto ti riempie di una strana determinazione.",
          "failureText": "Vorresti onorarli, ma la tua fame è più forte. Tieni le tue scorte per te, sentendoti un po' in colpa.",
          "items_lost": [{ "id": "ration_pack", "quantity": 1 }],
          "reward": { "type": "stat_boost", "stat": "carisma", "amount": 1, "duration": "permanent" }
        }
      ]
    },
    {
      "id": "plains_dust_devil",
      "title": "Diavolo di Polvere",
      "description": "All'improvviso, un piccolo ma violento tornado di polvere si forma davanti a te, sollevando detriti e terra. Puoi tentare di attraversarlo o cercare di aggirarlo, perdendo tempo prezioso.",
      "choices": [
        {
          "text": "Attraversalo di corsa",
          "skillCheck": { "stat": "agilita", "difficulty": 13 },
          "successText": "Con uno scatto fulmineo e i muscoli tesi, passi attraverso il vortice quasi indenne, sentendo solo il vento sferzarti il viso.",
          "failureText": "Vieni investito in pieno. La polvere ti acceca e i detriti ti colpiscono, lasciandoti ammaccato, disorientato e con qualche graffio.",
          "penalty": { "type": "damage", "amount": 10 }
        },
        {
          "text": "Aggiralo perdendo tempo",
          "actionKey": "ignore",
          "resultText": "Non ne vale la pena. Fai un lungo giro, perdendo quasi un'ora di luce.",
          "penalty": { "type": "time", "minutes": 60 }
        }
      ]
    },
    {
      "id": "plains_radio_tower",
      "title": "Torre Radio Solitaria",
      "description": "Una torre di trasmissione arrugginita si erge solitaria contro il cielo. Alla sua base c'è un piccolo capanno di manutenzione con la porta socchiusa. Potrebbe contenere componenti utili.",
      "choices": [
        {
          "text": "Esplora il capanno",
          "skillCheck": { "stat": "intelligenza", "difficulty": 10 },
          "successText": "All'interno, trovi una cassetta degli attrezzi. Contiene delle parti elettroniche e un kit di riparazione di base.",
          "failureText": "Il capanno è vuoto e pieno di polvere. Qualcuno è già passato di qui molto tempo fa.",
          "items_gained": [{ "id": "electronic_parts", "quantity": 4 }, { "id": "repair_kit", "quantity": 1 }]
        },
        {
          "text": "Tenta di arrampicarti sulla torre",
          "skillCheck": { "stat": "forza", "difficulty": 14 },
          "successText": "Con fatica, riesci a salire abbastanza in alto da avere una visuale migliore. Noti un'anomalia sulla mappa in lontananza.",
          "failureText": "Un piolo arrugginito cede sotto il tuo peso. Cadi da un paio di metri, facendoti male a una caviglia.",
          "reward": { "type": "reveal_map_poi" },
          "penalty": { "type": "status", "status": "WOUNDED" }
        }
      ]
    },
    {
      "id": "plains_old_well",
      "title": "Vecchio Pozzo",
      "description": "Ti imbatti in un vecchio pozzo di pietra. Una corda logora pende al suo interno. Potrebbe esserci ancora dell'acqua sul fondo, ma sembra profondo e buio.",
      "choices": [
        {
          "text": "Tira su il secchio",
          "skillCheck": { "stat": "forza", "difficulty": 11 },
          "successText": "La corda regge! Tiri su un secchio pieno di acqua fresca e pulita, filtrata dal terreno. Una vera fortuna.",
          "failureText": "Mentre tiri, la corda si spezza. Il secchio precipita nel buio con un tonfo sordo. L'occasione è persa.",
          "items_gained": [{ "id": "water_purified", "quantity": 3 }]
        },
        {
          "text": "Lascia perdere",
          "actionKey": "ignore",
          "resultText": "Non ti fidi della vecchia corda. Meglio non rischiare di perdere tempo o di cadere dentro."
        }
      ]
    },
    {
      "id": "plains_mirage",
      "title": "Miraggio",
      "description": "In lontananza, sotto il sole cocente, vedi quella che sembra un'oasi con acqua e palme. Potrebbe essere la tua salvezza, o solo un inganno della mente affaticata.",
      "choices": [
        {
          "text": "Dirigiti verso l'oasi",
          "skillCheck": { "stat": "intelligenza", "difficulty": 12 },
          "successText": "Ti avvicini e ti rendi conto che è solo un miraggio. Deluso, stai per andartene quando noti qualcosa di semi-sepolto nella sabbia dove avrebbe dovuto esserci l'acqua: una borraccia quasi piena!",
          "failureText": "Cammini per quasi un'ora verso l'oasi, solo per vederla svanire nel nulla. Hai sprecato tempo ed energie preziose per un'illusione.",
          "items_gained": [{ "id": "purified_water_bottle_large", "quantity": 1 }],
          "penalty": { "type": "time", "minutes": 60 }
        }
      ]
    },
    {
      "id": "plains_fissure",
      "title": "Fenditura nel Terreno",
      "description": "Una profonda crepa si apre nel terreno arido. È troppo larga per essere saltata facilmente. Puoi cercare un punto più stretto o provare a calarti al suo interno.",
      "choices": [
        {
          "text": "Cerca un passaggio",
          "skillCheck": { "stat": "intelligenza", "difficulty": 10 },
          "successText": "Dopo una breve ricerca, trovi un punto in cui le due sponde quasi si toccano, permettendoti di attraversare senza problemi.",
          "failureText": "Giri a vuoto per un po', non trovando un passaggio sicuro. Perdi tempo e decidi di tornare indietro.",
          "penalty": { "type": "time", "minutes": 30 }
        },
        {
          "text": "Calati nella fenditura",
          "skillCheck": { "stat": "agilita", "difficulty": 14 },
          "successText": "Scendendo con attenzione, scopri che la fenditura porta a una piccola grotta nascosta. All'interno trovi i resti di un accampamento e un kit medico.",
          "failureText": "Perdi la presa durante la discesa e scivoli, graffiandoti contro le rocce taglienti. Risali a fatica, ferito e senza aver trovato nulla.",
          "items_gained": [{ "id": "medkit_field", "quantity": 1 }],
          "penalty": { "type": "damage", "amount": 15 }
        }
      ]
    },
    {
      "id": "plains_vulture_circle",
      "title": "Cerchio di Avvoltoi",
      "description": "Vedi un gruppo di avvoltoi mutati che volteggiano in cerchio nel cielo. Stanno chiaramente girando sopra a qualcosa. Potrebbe essere una preda recente o un altro sopravvissuto in difficoltà.",
      "choices": [
        {
          "text": "Avvicinati per investigare",
          "resultText": "Spaventando gli avvoltoi, scopri che stavano banchettando con la carcassa di un grosso animale. Recuperi della carne e una pelle robusta.",
          "items_gained": [{ "id": "meat_raw", "quantity": 2 }, { "id": "animal_hide", "quantity": 1 }]
        },
        {
          "text": "Evita la zona",
          "actionKey": "ignore",
          "resultText": "Dove ci sono avvoltoi, spesso ci sono anche predatori più grandi. Decidi di non rischiare e cambi strada."
        },
        {
          "id": "plains_unsent_letter",
          "title": "Le Ultime Parole",
          "description": "Accanto allo scheletro di un vecchio postino, la sua borsa di pelle a brandelli è aperta come una ferita. Una singola lettera, quasi miracolosamente protetta da una busta di plastica ingiallita, è scivolata fuori. L'inchiostro è sbiadito, ma ancora leggibile. È indirizzata a una certa \"Anna\".",
          "choices": [
            {
              "text": "Leggi la lettera. Devi sapere.",
              "resultText": "Apri con delicatezza la busta. La carta è fragile. La calligrafia è elegante, ma diventa tremolante verso la fine, come se la mano che scriveva stesse lottando contro il tempo e la disperazione. Leggi uno stralcio:\"Mio caro Ultimo,\n\nSe stai leggendo questa lettera, significa che non sono più con te. Il mio cuore si spezza al pensiero di lasciarti solo, ma so che sei forte. Tua madre Lena ti ha trasmesso quella forza, anche se non l'hai mai conosciuta.\n\nC'è un posto, figlio mio. Un posto che tua madre chiamava 'The Safe Place'. Non so dove sia esattamente, ma so che esiste. Lena ne parlava sempre, con gli occhi che brillavano di una luce che non ho mai più visto dopo la sua morte.\n\nTrova quel posto, Ultimo. Troverai le risposte che cerchi, e forse... forse troverai la pace che io non sono mai riuscito a darti.\n\nRicorda: la compassione di tua madre e la determinazione che ti ho insegnato ti guideranno. Non dimenticare mai chi sei.\n\nCon tutto il mio amore,\nPapà\"\n\nLa lettera si interrompe qui. Il postino non è mai arrivato. E probabilmente, nemmeno Anna. Ripieghi il foglio, un pezzo di una storia d'amore tragica e incompiuta. Il peso di tutte le promesse infrante di questo mondo ti sembra, per un istante, troppo pesante da sopportare.",
              "emotionalImpact": { "dominantEmotion": "melancholy", "lenaMemoryStrength": 10, "understandingLevel": 5 }
            },
            {
              "text": "Lascia la lettera al suo messaggero caduto.",
              "resultText": "Decidi che quella lettera contiene una promessa troppo intima per essere violata. È un segreto tra due persone che questo mondo ha separato. Con un gesto di rispetto, riponi la lettera nella borsa del postino, accanto a lui. Lasci che il loro segreto riposi in pace. Questo piccolo atto di rispetto per i morti ti riempie di una strana, solenne determinazione.",
              "reward": { "type": "stat_boost", "stat": "carisma", "amount": 1, "duration": "temporary" }
            }
          ]
        },
        {
          "id": "plains_impact_crater",
          "title": "Ferita della Terra",
          "description": "Davanti a te si apre un piccolo cratere vetrificato, testimone di un impatto antico ma violento. Al centro, tra i frammenti di roccia fusa, noti un pezzo di metallo di forma strana, non terrestre.",
          "choices": [
            {
              "text": "Scendi con cautela per recuperare il metallo.",
              "skillCheck": { "stat": "agilita", "difficulty": 12 },
              "successText": "Riesci a scendere senza scivolare sulle superfici lisce. Il metallo è stranamente leggero e freddo al tatto. Non hai idea di cosa sia, ma sembra prezioso.",
              "failureText": "Scivoli lungo il pendio ripido, tagliandoti contro i bordi affilati del vetro nero. Il frammento di metallo rimane irraggiungibile.",
              "items_gained": [{ "id": "meteorite_fragment", "quantity": 1 }],
              "penalty": { "type": "damage", "amount": 8 }
            },
            {
              "text": "Evita il cratere. Potrebbe essere radioattivo.",
              "actionKey": "ignore",
              "resultText": "L'istinto di sopravvivenza prevale. Qualunque cosa sia caduta dal cielo, è meglio lasciarla dove si trova. Fai un largo giro."
            }
          ]
        },
        {
          "id": "plains_electronic_whispers",
          "title": "Voci Statiche",
          "description": "Passando vicino a un groviglio di cavi che spuntano dal terreno, il tuo walkie-talkie (se ne hai uno) gracida con una scarica di statica. Tra il rumore, ti sembra di percepire frammenti di voci.",
          "choices": [
            {
              "text": "Tenta di sintonizzarti sulla frequenza.",
              "itemRequirement": [{ "id": "walkie_talkie", "quantity": 1 }],
              "skillCheck": { "stat": "intelligenza", "difficulty": 14 },
              "successText": "Dopo aver armeggiato con la manopola, riesci a isolare un frammento di trasmissione: '...ripeto, il punto di raccolta a Delta-7 è compromesso. Ripiegare su...'. La trasmissione si interrompe. Hai ottenuto un'informazione potenzialmente vitale.",
              "failureText": "Riesci solo ad amplificare la statica. Qualsiasi messaggio ci fosse, è perso per sempre nel rumore bianco.",
              "reward": { "type": "lore_clue", "clueId": "delta_7_compromised" }
            },
            {
              "text": "Strappa i cavi per recuperare il rame.",
              "resultText": "Le voci fantasma non ti interessano. I cavi, invece, sono una fonte preziosa di rame. Li strappi dal terreno con fatica.",
              "items_gained": [{ "id": "copper_wire", "quantity": 3 }]
            }
          ]
        },
        {
          "id": "plains_mute_butterflies",
          "title": "Volo Silenzioso",
          "description": "Uno sciame di centinaia di farfalle, tutte di un bianco spettrale, ti volteggia intorno in un silenzio innaturale. Non c'è il minimo battito d'ali. È uno spettacolo bellissimo e profondamente inquietante.",
          "choices": [
            {
              "text": "Raccogli alcuni fiori.",
              "skillCheck": { "stat": "intelligenza", "difficulty": 12 },
              "successText": "Li esamini con attenzione. Noti che il polline ha proprietà leggermente soporifere e antisettiche. Potrebbero essere utili per creare bende calmanti o esche.",
              "failureText": "Mentre li raccogli, una polvere finissima si alza e ti irrita gli occhi e i polmoni. Inizi a tossire, sentendoti leggermente indebolito.",
              "items_gained": [{ "id": "ash_petals", "quantity": 3 }],
              "penalty": { "type": "status", "status": "SICK" }
            },
            {
              "text": "Rimani immobile e osservale.",
              "resultText": "Resti immobile mentre lo sciame silenzioso ti passa accanto. È uno dei pochi momenti di pura, strana bellezza che hai visto da molto tempo. Ti senti stranamente rinvigorito.",
              "reward": { "type": "status_heal", "status": "STRESSED" }
            }
          ]
        },
        {
          "id": "plains_barbed_wire_fence",
          "title": "Vecchio Confine",
          "description": "Una lunga linea di filo spinato arrugginito si estende a perdita d'occhio, un vecchio confine che non separa più nulla. In un punto, vedi lo scheletro di un cervo impigliato.",
          "choices": [
            {
              "text": "Recupera il filo spinato con attenzione.",
              "itemRequirement": [{ "id": "gloves_work", "quantity": 1 }],
              "skillCheck": { "stat": "agilita", "difficulty": 10 },
              "successText": "Usando i guanti, riesci a tagliare e arrotolare una buona quantità di filo spinato senza ferirti. Sarà ottimo per fortificare un rifugio.",
              "failureText": "Il filo è teso e scatta all'indietro mentre lo tagli, lasciandoti un profondo graffio sul braccio.",
              "items_gained": [{ "id": "barbed_wire_roll", "quantity": 1 }],
              "penalty": { "type": "damage", "amount": 5 }
            },
            {
              "text": "Ispeziona lo scheletro del cervo.",
              "resultText": "Ti avvicini allo scheletro. La maggior parte è stata spolpata, ma le corna sono intatte e possono essere usate come materiale o come arma improvvisata.",
              "items_gained": [{ "id": "antlers", "quantity": 2 }]
            }
          ]
        },
        {
          "id": "plains_oil_slick",
          "title": "Piaga Nera",
          "description": "Una vasta e densa macchia di olio nero e catramoso affiora dal terreno, soffocando ogni forma di vita. L'odore è acre.",
          "choices": [
            {
              "text": "Raccogli un po' di sostanza oleosa.",
              "itemRequirement": [{ "id": "empty_canister", "quantity": 1 }],
              "resultText": "Riempi con cautela una tanica. Questa sostanza è troppo grezza per essere usata come carburante, ma è altamente infiammabile. Potrebbe essere utile per creare molotov o per accendere fuochi umidi.",
              "items_gained": [{ "id": "crude_oil_canister", "quantity": 1 }]
            },
            {
              "text": "Cerca la fonte della perdita.",
              "resultText": "Segui la macchia fino a un vecchio tubo arrugginito che spunta dal terreno. È una perdita da un oleodotto sotterraneo. Decidi di segnare il punto sulla mappa per future necessità.",
              "reward": { "type": "special", "effect": "mark_oil_source" }
            }
          ]
        },
        {
          "id": "plains_kite_remains",
          "title": "Giocattolo Spezzato",
          "description": "Impigliato in un cespuglio spinoso, trovi i resti di un aquilone colorato, il suo filo spezzato che serpeggia nel vento. Un'immagine malinconica di un'infanzia interrotta.",
          "choices": [
            {
              "text": "Recupera il filo e la stoffa.",
              "resultText": "Con attenzione, liberi i resti dell'aquilone. La stoffa è robusta e il filo di nylon, sebbene aggrovigliato, è ancora molto resistente.",
              "items_gained": [{ "id": "nylon_wire", "quantity": 1 }, { "id": "durable_cloth", "quantity": 1 }]
            },
            {
              "text": "Lascialo come un monumento.",
              "actionKey": "ignore",
              "resultText": "Decidi di non toccarlo. Che rimanga lì, un piccolo, colorato monumento a un mondo che non c'è più. Prosegui, con un senso di tristezza nel cuore."
            }
          ]
        },
        {
          "id": "plains_battle_silence",
          "title": "Campo di Battaglia Silenzioso",
          "description": "Ti imbatti in un'area disseminata di bossoli arrugginiti, piccole trincee improvvisate e i resti di equipaggiamento militare. Qui si è combattuta una piccola, disperata battaglia, molto tempo fa.",
          "choices": [
            {
              "text": "Cerca munizioni o equipaggiamento utilizzabile.",
              "skillCheck": { "stat": "intelligenza", "difficulty": 12 },
              "successText": "La maggior parte delle cose è corroso dal tempo, ma riesci a trovare una scatola di munizioni impermeabile semi-sepolta e un elmetto da combattimento ancora integro.",
              "failureText": "Hai cercato ovunque, ma le intemperie e altri saccheggiatori non hanno lasciato nulla di valore.",
              "items_gained": [{ "id": "ammo_rifle", "quantity": 10 }, { "id": "combat_helmet", "quantity": 1 }]
            },
            {
              "text": "Cerca di ricostruire cosa è successo.",
              "skillCheck": { "stat": "intelligenza", "difficulty": 14 },
              "successText": "Analizzando la disposizione dei bossoli e le posizioni, capisci che un piccolo gruppo si è difeso strenuamente da un attacco più numeroso, vendendo cara la pelle. La loro determinazione ti ispira.",
              "failureText": "È impossibile dire cosa sia successo. È solo un caos di violenza passata.",
              "reward": { "type": "stat_boost", "stat": "vigore", "amount": 1, "duration": "permanent" }
            }
          ]
        },
        {
          "id": "plains_iridescent_puddle",
          "title": "Acqua Arcobaleno",
          "description": "Una grande pozzanghera riflette la luce con un luccichio innaturale, oleoso, simile a un arcobaleno. L'acqua sembra pulita, ma la patina colorata è sospetta.",
          "choices": [
            {
              "text": "Raccogli l'acqua e filtrala più tardi.",
              "resultText": "Raccogli l'acqua. Non la berrai così com'è, ma con un buon filtro potresti riuscire a purificarla dai contaminanti chimici.",
              "items_gained": [{ "id": "water_contaminated", "quantity": 2 }]
            },
            {
              "text": "Analizza il terreno circostante.",
              "resultText": "Noti che la contaminazione proviene da alcuni barili arrugginiti semi-sepolti poco più a monte. Evitando la pozzanghera, trovi un piccolo sentiero che aggira la zona contaminata, probabilmente tracciato da animali che hanno imparato a evitarla.",
              "reward": { "type": "special", "effect": "reveal_safe_path" }
            }
          ]
        },
        {
          "id": "plains_wind_chime",
          "title": "Musica Fantasma",
          "description": "Appeso all'unico ramo di un albero morto, un carillon a vento fatto di vecchie posate e pezzi di metallo emette un suono dissonante e malinconico a ogni soffio di vento.",
          "choices": [
            {
              "text": "Smontalo per recuperare i materiali.",
              "resultText": "La musica è triste, ma i materiali sono utili. Smonti con cura il carillon, recuperando fili metallici e piccoli pezzi di metallo.",
              "items_gained": [{ "id": "metal_wire", "quantity": 3 }, { "id": "scrap_metal_small", "quantity": 5 }]
            },
            {
              "text": "Ascolta la sua canzone per un po'.",
              "resultText": "Ti siedi e ascolti la musica casuale e triste del carillon. In questo mondo silenzioso, anche un suono così stonato ha una sua strana bellezza. Ti senti meno solo.",
              "reward": { "type": "status_heal", "status": "LONELY" }
            }
          ]
        },
        {
          "id": "plains_lone_glyph",
          "title": "Il Segno sul Sasso",
          "description": "In mezzo a un'immensa distesa d'erba secca, trovi una singola, grande pietra piatta. Sulla sua superficie è inciso un glifo che non riconosci, ma che emana una strana sensazione di pace.",
          "choices": [
            {
              "text": "Tocca il glifo.",
              "resultText": "Esitante, posi la mano sulla pietra fredda. Un calore inaspettato si diffonde attraverso di te, calmando i tuoi nervi e alleviando la tua stanchezza. Qualunque fosse lo scopo di questo segno, era benevolo.",
              "reward": { "type": "status_heal", "status": ["TIRED", "ANXIOUS"] },
              "hp_recovery": { "amount": 5 }
            },
            {
              "text": "Studia il glifo da lontano.",
              "skillCheck": { "stat": "intelligenza", "difficulty": 14 },
              "successText": "Osservando la forma e l'usura della pietra, capisci che è un antico segnavia. Il glifo non indica una direzione, ma un concetto: 'riposo sicuro qui'. Ti senti rassicurato, sapendo che per un po' sei al riparo da minacce immediate.",
              "failureText": "Il simbolo rimane un mistero. Potrebbe essere qualsiasi cosa. La prudenza ti suggerisce di non interagire con l'ignoto.",
              "reward": { "type": "special", "effect": "prevent_random_encounter", "duration": "3_hours" }
            }
          ]
        },
        {
          "id": "plains_ash_flowers",
          "title": "Fiori di Cenere",
          "description": "Ti imbatti in un'area surreale dove dal terreno grigiastro spuntano centinaia di fiori delicati i cui petali sono del colore della cenere. Un vento leggero li fa ondeggiare, creando un'immagine di una bellezza triste e malinconica.",
          "choices": [
            {
              "text": "Raccogli alcuni fiori.",
              "skillCheck": { "stat": "intelligenza", "difficulty": 12 },
              "successText": "Li esamini con attenzione. Noti che il polline ha proprietà leggermente soporifere e antisettiche. Potrebbero essere utili per creare bende calmanti o esche.",
              "failureText": "Mentre li raccogli, una polvere finissima si alza e ti irrita gli occhi e i polmoni. Inizi a tossire, sentendoti leggermente indebolito.",
              "items_gained": [{ "id": "ash_petals", "quantity": 3 }],
              "penalty": { "type": "status", "status": "SICK" }
            },
            {
              "text": "Attraversa il campo senza toccare nulla.",
              "actionKey": "ignore",
              "resultText": "Decidi di non disturbare questa strana e silenziosa bellezza. Attraversi il campo con rispetto, sentendo la cenere scricchiolare dolcemente sotto i tuoi stivali."
            }
          ]
        },
        {
          "id": "plains_fossilized_lightning",
          "title": "La Cicatrice del Cielo",
          "description": "Il terreno davanti a te è vetrificato in uno schema a raggiera, come se un fulmine di incredibile potenza avesse colpito qui, trasformando la sabbia in vetro nero e contorto. Al centro della \"cicatrice\", qualcosa brilla.",
          "choices": [
            {
              "text": "Recupera il frammento al centro.",
              "skillCheck": { "stat": "agilita", "difficulty": 13 },
              "successText": "Camminando con attenzione sul vetro tagliente, raggiungi il centro. Recuperi un pezzo di fulgurite, un frammento di vetro naturale percorso da una strana energia. È caldo al tatto.",
              "failureText": "Un pezzo di vetro si frantuma sotto il tuo peso, facendoti perdere l'equilibrio. Cadi, tagliandoti le mani e le ginocchia sulla superficie affilata.",
              "items_gained": [{ "id": "fulgurite_shard", "quantity": 1 }],
              "penalty": { "type": "damage", "amount": 10 },
              "status": { "status": "WOUNDED" }
            },
            {
              "text": "Raccogli i frammenti di vetro più piccoli dai bordi.",
              "resultText": "Non rischi di avventurarti al centro. Raccogli con cura alcuni frammenti di vetro nero dai bordi. Sono affilati come rasoi e potrebbero essere usati per creare punte di freccia o un'arma improvvisata.",
              "items_gained": [{ "id": "obsidian_shard", "quantity": 4 }]
            }
          ]
        },
        {
          "id": "plains_giant_skeleton",
          "title": "Dove Dormono i Giganti",
          "description": "Le ossa sbiancate di una creatura enorme, molto più grande di qualsiasi cosa tu abbia mai visto, spuntano dal terreno. La sua cassa toracica è grande come una piccola grotta.",
          "choices": [
            {
              "text": "Cerca riparo all'interno della cassa toracica.",
              "resultText": "Entri nel riparo offerto dalle costole gigantesche. È un luogo macabro, ma ti protegge dal vento sferzante. Ti concedi un breve ma profondo riposo.",
              "reward": { "type": "hp_recovery", "amount": 20 },
              "penalty": { "type": "time", "minutes": 60 }
            },
            {
              "text": "Stacca un frammento d'osso per usarlo come arma o attrezzo.",
              "skillCheck": { "stat": "forza", "difficulty": 12 },
              "successText": "Riesci a spezzare un pezzo di una costola. È incredibilmente denso e resistente, perfetto per essere affilato e usato come una clava o un'arma da taglio pesante.",
              "failureText": "L'osso è più duro della roccia. Non riesci a scalfirlo. I tuoi sforzi ti lasciano solo con le mani doloranti.",
              "items_gained": [{ "id": "giant_bone_club", "quantity": 1 }]
            }
          ]
        },
        {
          "id": "plains_lone_tree",
          "title": "L'Ultimo Albero",
          "description": "Un unico, enorme albero contorto si erge solitario in mezzo alla pianura, un sopravvissuto solitario. Ai suoi piedi, il terreno è coperto da uno strato di foglie secche.",
          "choices": [
            {
              "text": "Cerca tra le foglie alla base.",
              "resultText": "Frugando tra le foglie accumulate da anni, trovi una piccola scorta di noci selvatiche, ben conservate e ancora commestibili, nascoste da qualche creatura previdente.",
              "items_gained": [{ "id": "wild_nuts", "quantity": 3 }]
            },
            {
              "text": "Arrampicati per avere una vista migliore.",
              "skillCheck": { "stat": "agilita", "difficulty": 11 },
              "successText": "I rami sono robusti. Dall'alto, riesci a vedere oltre l'orizzonte piatto, notando un sentiero nascosto che non era visibile dal basso.",
              "failureText": "Un ramo secco si spezza e scivoli, rimanendo appeso a mezz'aria prima di riuscire a scendere. Non hai visto nulla e hai solo rischiato.",
              "reward": { "type": "special", "effect": "reveal_hidden_path" }
            }
          ]
        }
      ]
    }
  ]
}