{
  "UNIQUE": [
    {
      "id": "city_unique_webradio",
      "isUnique": true,
      "title": "Segnale Radio Fantasma",
      "description": "Da un vecchio ricevitore radio in un negozio di elettronica in rovina, senti una voce metallica che ripete un messaggio in loop: '...safe...place...coordinate...tre-uno-quattro...uno-cinque-nove...'.",
      "choices": [
        {
          "text": "Ascolta attentamente e annota",
          "skillCheck": { "stat": "intelligenza", "difficulty": 10 },
          "successText": "Annoti le coordinate. Sembrano puntare a una zona remota delle montagne. Che sia il 'Safe Place' di cui parlava tuo padre?",
          "failureText": "La trasmissione si interrompe con una scarica di statica prima che tu possa capire tutte le cifre. Un'occasione persa.",
          "reward": { "type": "quest_update", "questId": "main_quest", "data": { "coordinates_found": true } }
        }
      ]
    },
    {
      "id": "unique_eurocenter",
      "isUnique": true,
      "title": "Resti di un'Epoca Lontana",
      "description": "Ti imbatti nelle rovine di quello che sembra un vecchio ufficio. Un'insegna di metallo contorto, caduta a terra, recita '...mobiliare Eurocenter'. All'interno, tra le carte fradice, noti lo scheletro di un uomo in un abito elegante, ormai a brandelli. Al collo porta ancora un cartellino identificativo: 'Marco G.'.",
      "choices": [
        {
          "text": "Fruga tra i resti",
          "resultText": "Tra le macerie e i ricordi di un mondo perduto, trovi alcuni oggetti utili che il povero Marco non avrà più bisogno di usare.",
          "items_gained": [{ "id": "canned_food", "quantity": 1 }, { "id": "medical_supplies", "quantity": 1 }]
        }
      ]
    },
    {
      "id": "unique_magnetar",
      "isUnique": true,
      "title": "Una Scatola Misteriosa",
      "description": "Appoggiato a un muro crollato, vedi il corpo mummificato di un uomo. Stringe al petto una piccola scatola di metallo nero, come se fosse la cosa più preziosa al mondo. Sulla scatola, un'etichetta quasi completamente corrosa dal tempo lascia intravedere una scritta: '...gnetar...cosa...'.",
      "choices": [
        {
          "text": "Apri la scatola",
          "resultText": "Con rispetto per il defunto, liberi delicatamente la scatola dalle sue mani. All'interno trovi provviste ben conservate, come se qualcuno avesse saputo che un giorno sarebbero servite a un altro sopravvissuto.",
          "items_gained": [{ "id": "water_bottle", "quantity": 1 }, { "id": "pain_killers", "quantity": 1 }]
        }
      ]
    },
    {
      "id": "unique_bunker_discovery",
      "isUnique": true,
      "title": "Bunker Abbandonato",
      "description": "Scopri l'ingresso nascosto di un bunker pre-guerra. La porta d'acciaio è socchiusa e un debole bagliore filtra dall'interno.",
      "choices": [
        {
          "text": "Entra nel bunker",
          "skillCheck": { "stat": "costituzione", "difficulty": 12 },
          "successText": "Riesci a forzare la porta e ad entrare. Il bunker contiene scorte militari ancora utilizzabili.",
          "failureText": "La porta è troppo pesante e arrugginita. I tuoi sforzi sono vani e ti ferisci nel tentativo.",
          "items_gained": [{ "id": "military_rations", "quantity": 2 }, { "id": "first_aid_kit", "quantity": 1 }],
          "penalty": { "type": "damage", "amount": 5 }
        }
      ]
    },
    {
      "id": "unique_scientist_notes",
      "isUnique": true,
      "title": "Diario di uno Scienziato",
      "description": "In un laboratorio abbandonato trovi il diario di uno scienziato. Le ultime pagine parlano di un 'progetto di evacuazione' e di coordinate segrete.",
      "choices": [
        {
          "text": "Studia attentamente il diario",
          "skillCheck": { "stat": "intelligenza", "difficulty": 15 },
          "successText": "Decifri le note dello scienziato. Le informazioni potrebbero essere cruciali per la tua missione.",
          "failureText": "La calligrafia è troppo confusa e molte pagine sono danneggiate. Non riesci a estrarre informazioni utili.",
          "reward": { "type": "lore_clue", "clueId": "scientist_evacuation", "description": "Informazioni su un piano di evacuazione segreto" }
        }
      ]
    },
    {
      "id": "unique_time_capsule",
      "isUnique": true,
      "title": "Capsula del Tempo",
      "description": "Sotto le macerie di una scuola elementare trovi una capsula del tempo sepolta dai bambini prima della catastrofe. Contiene lettere, foto e piccoli oggetti personali.",
      "choices": [
        {
          "text": "Apri la capsula con rispetto",
          "resultText": "Tra i ricordi innocenti di un mondo perduto, trovi anche alcune provviste che i bambini avevano nascosto per 'il futuro'.",
          "items_gained": [{ "id": "candy", "quantity": 3 }, { "id": "toy", "quantity": 1 }]
        }
      ]
    }
  ]
}