[
    {
        "id": "lore_project_echo",
        "title": "On Project Echo",
        "category": "project",
        "text": "Project Echo was an ambitious attempt to create a collective neural interface - a network that was supposed to connect human minds to facilitate global communication and cooperation.\n\nBut something went terribly wrong. Instead of uniting humanity, the system created what we now call 'The Great Silence' - a wave of frequencies that shut down not only machines and communications, but also something fundamental in the human soul.\n\nSome simply fell, like puppets with cut strings. Others... others began to change, transforming into something different. Project Echo was not a weapon, but its consequences were more devastating than any bomb.\n\nThe library preserves fragments of code and research notes, silent testimonies of a utopia turned into a nightmare."
    },
    {
        "id": "lore_project_rebirth",
        "title": "On Project Rebirth",
        "category": "project",
        "text": "Project Rebirth was the desperate response to the collapse caused by Project Echo. Scientists and doctors worked frantically to understand and reverse the effects of the Great Silence.\n\nLab notes reveal experiments on tissue samples from 'Ash Angels' - the creatures that emerged after the Silence. Researchers discovered that these entities were not simply random mutations, but the result of a transformation process guided by the very frequencies of Project Echo.\n\nProject Rebirth attempted to create an 'antidote' - a counter-frequency that could have awakened those who had fallen into the Silence. But the results were inconclusive, and the lab was abandoned before they could complete their work.\n\nA disturbing question remains: are the Ash Angels victims of Project Echo... or its intentional evolution?"
    },
    {
        "id": "lore_clan_of_the_raven",
        "title": "The Raven Clan",
        "category": "history",
        "text": "The Raven Clan was a group of elite explorers and survivors, founded by a man named Jonas in the early years after the Great Silence.\n\nTheir symbol - a stylized raven - represented their philosophy: like ravens, they had to be intelligent, adaptable, and capable of finding opportunities even in death and desolation.\n\nJonas and his clan mapped vast areas of the wastelands, creating safe shelters and developing advanced survival techniques. The talisman he carried was the symbol of his leadership and the hope the clan represented.\n\nBut like many things in this world, the Raven Clan also vanished into silence. Jonas disappeared during an expedition, and without his guidance, the clan dispersed. Now only echoes of their legacy remain - passed down survival techniques, hidden shelters, and forgotten talismans waiting to be discovered."
    }
]