
[
  {
    "id": "city_easter_egg_pixeldebh_v2",
    "title": "Strano Ritrovamento Metallico",
    "description": "Rovistando tra detriti metallici e cemento sbriciolato, la luce del sole si riflette su uno strano oggetto lucido. È una placca argentata con un simbolo insolito e la scritta parzialmente leggibile 'PixelDebh'. Sembra il pezzo di un macchinario più grande.",
    "biomes": ["Città"],
    "isUnique": true,
    "choices": [
      {
        "text": "Pulisci la placca e ispezionala",
        "outcomes": [
          {
            "type": "skillCheck",
            "skill": "investigare",
            "dc": 12,
            "successText": "Pulendo la placca, scopri che è un pannello di accesso. Dietro di essa, incastonato in un pezzo di macchinario, c'è un piccolo kit di componenti elettronici di alta qualità e una bevanda energetica, probabilmente la scorta di un tecnico.",
            "failureText": "La placca è solo un pezzo di decorazione. Non c'è nulla di interessante o utile al di sotto. Hai solo perso tempo.",
            "success": [
              { "type": "addItem", "value": { "itemId": "military_grade_electronics", "quantity": 1 } },
              { "type": "addItem", "value": { "itemId": "energy_drink_nuclear", "quantity": 1 } },
              { "type": "addXp", "value": 50 }
            ],
            "failure": [
              { "type": "addXp", "value": 10 }
            ]
          }
        ]
      },
      {
        "text": "Tienila come portafortuna",
        "outcomes": [
          {
            "type": "direct",
            "results": [
              { "type": "journalEntry", "text": "Decidi di tenere la strana placca. È un pezzo di un mondo che non capisci, ma ha un'aria... fortunata. La metti nello zaino." },
              { "type": "addItem", "value": { "itemId": "pixeldebh_plate", "quantity": 1 } },
              { "type": "addXp", "value": 20 }
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "unique_eurocenter",
    "title": "Resti di un'Epoca Lontana",
    "description": "Ti imbatti nelle rovine di quello che sembra un vecchio ufficio. Un'insegna di metallo contorto, caduta a terra, recita '...mobiliare Eurocenter'. All'interno, tra le carte fradice, noti lo scheletro di un uomo in un abito elegante, ormai a brandelli. Al collo porta ancora un cartellino identificativo: 'Marco G.'.",
    "biomes": ["Città"],
    "isUnique": true,
    "choices": [
      {
        "text": "Fruga tra i suoi averi",
        "outcomes": [
          {
            "type": "direct",
            "results": [
              { "type": "journalEntry", "text": "Con un certo rispetto, controlli le sue tasche. Trovi un pacchetto di sigarette ancora sigillato, un flacone di antidolorifici e un biglietto da visita professionale. Povero Marco G., qualunque sia stata la sua storia." },
              { "type": "addItem", "value": { "itemId": "MED_PAINKILLER", "quantity": 1 } },
              { "type": "addItem", "value": { "itemId": "cigarettes_pack", "quantity": 1 } },
              { "type": "addItem", "value": { "itemId": "eurocenter_business_card", "quantity": 1 } },
              { "type": "addXp", "value": 25 }
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "easter_egg_runtime_radio",
    "title": "Una Voce dall'Etere",
    "description": "Mentre cammini nel silenzio opprimente, un ricevitore radio portatile che hai con te, che credevi capace solo di captare statica, si anima improvvisamente. Una voce chiara e calda, accompagnata da musica pre-catastrofe, riempie l'aria: \"...e quella era 'Take on Me' degli a-ha, qui è Runtime Radio, la vostra unica e sola voce nella desolazione. Non mollate, sopravvissuti. Non siete soli.\" La trasmissione è così pulita e viva che sembra impossibile.",
    "biomes": ["Pianura", "Foresta"],
    "isUnique": true,
    "choices": [
      {
        "text": "Ascolta la trasmissione",
        "outcomes": [
          {
            "type": "direct",
            "results": [
              { "type": "journalEntry", "text": "Ti fermi per qualche minuto, ipnotizzato da quel frammento del mondo perduto. La musica e la voce speranzosa ti danno una carica inaspettata. Prima che il segnale svanisca di nuovo nella statica, riesci a registrare un pezzo della canzone su una vecchia cassetta." },
              { "type": "heal", "value": 10 },
              { "type": "addXp", "value": 50 },
              { "type": "addItem", "value": { "itemId": "rare_music_cassettes", "quantity": 1 } }
            ]
          }
        ]
      },
      {
        "text": "Cerca di triangolare il segnale",
        "outcomes": [
          {
            "type": "skillCheck",
            "skill": "investigare",
            "dc": 15,
            "successText": "Manipolando l'antenna, riesci a farti un'idea approssimativa della direzione del segnale. Sembra provenire da molto, molto lontano, verso est. È un'informazione vaga, ma è più di niente.",
            "failureText": "Provi a sintonizzare meglio, ma il segnale è instabile. Con un ultimo crepitio, svanisce, lasciandoti con più domande che risposte.",
            "success": [
              { "type": "revealMapPOI", "text": "Hai triangolato il segnale! Sembra provenire da una zona remota verso est." },
              { "type": "addXp", "value": 75 }
            ],
            "failure": [
              { "type": "addXp", "value": 15 }
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "unique_magnetar",
    "title": "Una Scatola Misteriosa",
    "description": "Appoggiato a un muro crollato, vedi il corpo mummificato di un uomo. Stringe al petto una piccola scatola di metallo nero, come se fosse la cosa più preziosa al mondo. Sulla scatola, un'etichetta quasi completamente corrosa dal tempo e dagli agenti atmosferici lascia intravedere una scritta argentata: '...gnetar...cosa...'.",
    "biomes": ["Città", "Pianura"],
    "isUnique": true,
    "choices": [
      {
        "text": "Forza l'apertura della scatola",
        "outcomes": [
          {
            "type": "direct",
            "results": [
              { "type": "journalEntry", "text": "Riesci ad aprire la scatola con un po' di sforzo. All'interno, protetto da uno strato di schiuma isolante, c'è un iniettore medico di tipo militare e una barretta energetica ad alto contenuto calorico. Un vero tesoro, lasciato qui da uno sfortunato viaggiatore." },
              { "type": "addItem", "value": { "itemId": "stimpak_military", "quantity": 1 } },
              { "type": "addItem", "value": { "itemId": "high_energy_bar", "quantity": 1 } },
              { "type": "addXp", "value": 40 }
            ]
          }
        ]
      }
    ]
  }
]
