[
  {
    "id": "lore_project_echo",
    "title": "Sul Progetto Eco",
    "category": "project",
    "text": "Il Progetto Eco era un tentativo ambizioso di creare un'interfaccia neurale collettiva - una rete che avrebbe dovuto connettere le menti umane per facilitare la comunicazione e la cooperazione globale.\n\nMa qualcosa andò terribilmente storto. Invece di unire l'umanità, il sistema creò quello che ora chiamiamo 'Il Grande Silenzio' - un'onda di frequenze che spense non solo le macchine e le comunicazioni, ma anche qualcosa di fondamentale nell'animo umano.\n\nAlcuni semplicemente caddero, come marionette con i fili tagliati. Altri... altri iniziarono a cambiare, trasformandosi in qualcosa di diverso. Il Progetto Eco non era un'arma, ma le sue conseguenze furono più devastanti di qualsiasi bomba.\n\nLa biblioteca conserva frammenti di codice e note di ricerca, testimonianze silenziose di un'utopia trasformata in incubo."
  },
  {
    "id": "lore_project_rebirth",
    "title": "Sul Progetto Rinascita",
    "category": "project",
    "text": "Il Progetto Rinascita era la risposta disperata al collasso causato dal Progetto Eco. Scienziati e medici lavorarono freneticamente per comprendere e invertire gli effetti del Grande Silenzio.\n\nLe note del laboratorio rivelano esperimenti su campioni di tessuto degli 'Angeli della Cenere' - le creature che emersero dopo il Silenzio. I ricercatori scoprirono che queste entità non erano semplicemente mutazioni casuali, ma il risultato di un processo di trasformazione guidato dalle stesse frequenze del Progetto Eco.\n\nIl Progetto Rinascita tentò di creare un 'antidoto' - una contro-frequenza che avrebbe potuto risvegliare coloro che erano caduti nel Silenzio. Ma i risultati furono inconcludenti, e il laboratorio fu abbandonato prima che potessero completare il loro lavoro.\n\nResta un interrogativo inquietante: gli Angeli della Cenere sono vittime del Progetto Eco... o la sua evoluzione intenzionale?"
  },
  {
    "id": "lore_clan_of_the_raven",
    "title": "Il Clan del Corvo",
    "category": "history",
    "text": "Il Clan del Corvo era un gruppo di esploratori e sopravvissuti d'élite, fondato da un uomo di nome Jonas nei primi anni dopo il Grande Silenzio.\n\nIl loro simbolo - un corvo stilizzato - rappresentava la loro filosofia: come i corvi, dovevano essere intelligenti, adattabili e capaci di trovare opportunità anche nella morte e nella desolazione.\n\nJonas e il suo clan mapparono vaste aree delle terre desolate, creando rifugi sicuri e sviluppando tecniche di sopravvivenza avanzate. Il talismano che portava era il simbolo della sua leadership e della speranza che il clan rappresentava.\n\nMa come molte cose in questo mondo, anche il Clan del Corvo svanì nel silenzio. Jonas scomparve durante una spedizione, e senza la sua guida, il clan si disperse. Ora restano solo echi della loro eredità - tecniche di sopravvivenza tramandate, rifugi nascosti, e talismani dimenticati che attendono di essere scoperti."
  }
]