
[
  {
    "id": "CS_OPENING",
    "title": "L'Ultima Lezione",
    "pages": [
      {
        "text": "La carta trema tra le tue dita, le ultime parole di tuo padre incise a fuoco nella tua mente: \"...sii forte, come ti ho insegnato. Con tutto l'amore che un padre può dare, Papà.\"\n\nL'amore. Una parola che suona strana, quasi estranea, dopo anni di addestramento spietato. E ora, quel silenzio. Un silenzio assordante che urla una sola, terribile verità: sei solo.\n\nLa rabbia e la paura si mescolano nel tuo petto, un groviglio soffocante. La lettera, questo fragile pezzo di carta, è l'unica cosa che ti lega a lui, al passato, a questa missione che ti ha imposto.\n\nCosa ne fai?",
        "choices": [
          { "text": "[1] Strappi la lettera in un impeto di rabbia.", "targetPage": 1 },
          { "text": "[2] Pieghi la lettera con cura e la metti in tasca.", "targetPage": 2 }
        ]
      },
      {
        "text": "Il suono della carta che si strappa è un urlo nel silenzio del rifugio. Un pezzo, poi un altro, finché le sue parole non sono che frammenti inutili sul pavimento polveroso.\n\nUn addestramento spietato per un abbandono altrettanto spietato. Questa è stata la sua ultima lezione. Non ci sarà più un'altra parola, un altro ordine. Solo questo.\n\nI frammenti bianchi ai tuoi piedi sembrano neve su un terreno morto.",
        "consequences": [{ "type": "setFlag", "payload": "FATHERS_LETTER_DESTROYED" }],
        "nextPage": 3
      },
      {
        "text": "Le sue parole sono tutto ciò che ti resta di lui. Un testamento, una condanna, una speranza. Qualunque cosa siano, sono tue.\n\nCon una cura che non sapevi di possedere, pieghi il foglio lungo le sue pieghe consumate e lo infili nella tasca più interna degli stracci che indossi, vicino al cuore. Un peso piccolo, ma immenso.\n\nÈ un fardello che hai deciso di portare.",
        "consequences": [{ "type": "addItem", "payload": { "itemId": "fathers_letter", "quantity": 1 } }],
        "nextPage": 3
      },
      {
        "text": "Ti trascini verso l'unica finestra del rifugio, una ferita di vetro sporco nel muro di cemento. Il mondo esterno è un mare grigio e indifferente, un panorama di desolazione che hai sempre guardato con lui al tuo fianco.\n\nMa ora la sua spalla non è più lì a cui appoggiarti.\n\nPer la prima volta, la parola \"solo\" ha un peso reale, un sapore di cenere in bocca. Una lacrima, poi un'altra, tracciano sentieri puliti sulla polvere del tuo viso.",
        "nextPage": 4
      },
      {
        "text": "Ma le lacrime si fermano, quasi subito. La sua voce, dura e inflessibile, risuona nella tua testa, un'eco di mille lezioni impartite.\n\n\"La paura è un lusso che non puoi permetterti.\"\n\"Il sangue è prezioso. Non sprecarlo.\"\n\"La fame è un'insegnante. Ascoltala, ma non lasciare che ti comandi.\"\n\nPiangere non purificherà l'acqua. La rabbia non cuocerà la carne. La disperazione non medicherà una ferita.\n\nTi alzi. L'addestramento è finito. La sopravvivenza è iniziata.",
        "nextPage": 5
      },
      {
        "text": "Mentre i tuoi occhi si adattano alla penombra, ora non più velati dal dolore ma acuti per necessità, noti qualcosa vicino alla porta che prima avevi ignorato.\n\nÈ un fagotto di tela cerata, compatto e pesante, legato con uno spago robusto. Non era lì ieri. L'ha lasciato per te. Un ultimo, pragmatico gesto di cura.\n\nSopra, c'è un altro biglietto, più piccolo.",
        "nextPage": 6
      },
      {
        "text": "Lo apri. La sua calligrafia è più frettolosa, quasi un appunto.\n\n\"Ultimo,\nSe stai leggendo questo, hai superato la prima prova: scegliere di vivere. Dentro troverai il necessario per i primi giorni: due borracce d'acqua già purificata, tre razioni di cibo a lunga conservazione, delle bende pulite. Non è molto, ma tu sai come trovare il resto.\n\nIl coltello che porti alla cintura è arrugginito, ma affilato. Gli stracci che indossi non ti proteggeranno, ma ti terranno al caldo. Spera di trovare di meglio.\n\nLa strada la conosci. Te l'ho insegnata. Ci rivedremo. Forse al Safe Place.\"",
        "consequences": [
          { "type": "addItem", "payload": { "itemId": "CONS_002", "quantity": 2 } },
          { "type": "addItem", "payload": { "itemId": "CONS_001", "quantity": 3 } },
          { "type": "addItem", "payload": { "itemId": "CONS_003", "quantity": 2 } },
          { "type": "addItem", "payload": { "itemId": "weapon_knife_rusty", "quantity": 1 } },
          { "type": "addItem", "payload": { "itemId": "armor_rags", "quantity": 1 } },
          { "type": "equipItem", "payload": "weapon_knife_rusty" },
          { "type": "equipItem", "payload": "armor_rags" }
        ],
        "nextPage": 7
      },
      {
        "text": "Raccogli il fagotto, sentendone il peso rassicurante. Controlli il coltello alla cintura, il suo freddo metallo un'estensione della tua mano. Ti guardi gli stracci che indossi, un promemoria della tua vulnerabilità.\n\nGuardi la stanza per l'ultima volta. Per anni, queste quattro mura sono state la tua scuola, la tua prigione, il tuo unico mondo protetto. Ora, sono solo un guscio vuoto. Un ricordo.\n\nApri la porta e un refolo di vento freddo ti dà il benvenuto nel mondo reale.\n\nIl tuo viaggio è iniziato.",
        "nextPage": null
      }
    ]
  },
  {
    "id": "CS_RIVER_INTRO",
    "title": "Lo Specchio Scuro",
    "pages": [
      {
        "text": "Ti fermi. L'aria è cambiata. C'è un odore umido e terroso che non sentivi da tempo, e un suono basso, quasi impercettibile, che si fa strada attraverso il silenzio: il mormorio dell'acqua.\n\nPoco più avanti, una linea scura taglia la desolazione. Un fiume. Non è un ruscello innocente, ma una cicatrice liquida e torbida che scorre lenta, come sangue denso. La sua superficie è uno specchio nero che riflette il cielo grigio, un'apparente immobilità che stona con il resto del mondo.\n\nUn'oasi in mezzo al nulla. Un invito. Una trappola.",
        "nextPage": 1
      },
      {
        "text": "La lezione di tuo padre ti risuona in testa, chiara come il giorno in cui te l'ha impartita, proprio sulla riva di un fiume come questo.\n\n\"L'acqua è vita, Ultimo. Ma è anche morte. Non fidarti mai di ciò che sembra calmo. La corrente che non vedi è quella che ti trascina via. I predatori più pericolosi sono quelli che aspettano, immobili, appena sotto la superficie.\"\n\nOgni passo verso quella riva dovrà essere calcolato. Ogni sorso, una scommessa. Dietro quella calma apparente, sai che potrebbe nascondersi un pericolo invisibile, o peggio, la fine del tuo viaggio.",
        "nextPage": null
      }
    ]
  },
  {
    "id": "CS_BEING_WATCHED",
    "title": "L'Ombra che non fa Rumore",
    "pages": [
      {
        "text": "Il sole inizia a calare, tingendo il cielo di un arancione malato. Decidi che è il momento di fermarsi. Il riposo non è un lusso, è un'arma. Lo diceva sempre tuo padre.\n\nTrovi un riparo di fortuna, una nicchia tra due rocce crollate, e inizi la routine che ti è stata inculcata fin da bambino. I gesti sono automatici, quasi meccanici. Un piccolo fuoco, alimentato da sterpi secchi, prende vita con un crepitio familiare. L'acqua viene razionata, un sorso misurato. Un pezzo di carne essiccata viene masticato lentamente, ogni caloria un piccolo trionfo contro la fame.\n\nPer un istante, quasi ti dimentichi di essere solo. È un momento di calma, un'isola di normalità in un oceano di caos.",
        "nextPage": 1
      },
      {
        "text": "Poi, la senti.\n\nNon è un suono. Il vento continua a sibilare come sempre. Il fuoco continua a scoppiettare. Ma qualcosa è cambiato. È una sensazione fredda che ti serpeggia lungo la spina dorsale, un istinto primordiale che urla in silenzio.\n\nSei osservato.\n\nIl tuo corpo si irrigidisce. Ogni muscolo si tende, pronto a scattare. La mano corre istintivamente all'elsa del coltello. I tuoi occhi scattano da un'ombra all'altra, scrutando il crepuscolo. Non c'è niente. Nessun movimento. Nessuna forma innaturale tra le rovine. Eppure, la sensazione persiste, pesante come una cappa. Non sono gli occhi di una bestia affamata, né quelli di un predone in agguato. È qualcosa di diverso. Qualcosa di... antico. E freddo.",
        "nextPage": 2
      },
      {
        "text": "Rimani immobile per un tempo che sembra infinito, il cuore che batte all'impazzata, ogni respiro un rischio. Ma non accade nulla. Il silenzio torna ad essere solo silenzio.\n\nForse è solo la tua mente, logorata dalla solitudine e dalla tensione. Una paranoia da sopravvissuto.\n\nDecidi di riposare comunque, ma è un sonno leggero, da preda. Un occhio sempre socchiuso, un orecchio sempre teso.\n\nQuando finalmente ti rimetti in cammino, una figura alta e sottile, indistinguibile dalle ombre allungate delle rovine, si stacca silenziosamente da un muro e inizia a seguirti, i suoi passi che non lasciano impronte e non fanno alcun rumore.",
        "consequences": [{ "type": "performModifiedRest" }],
        "nextPage": null
      }
    ]
  },
    {
    "id": "CS_ASH_LULLABY",
    "title": "La Ninnananna della Cenere",
    "pages": [
      {
        "text": "Le tue dita, tremanti, sollevano il coperchio. Il meccanismo scatta con un clic secco. Una melodia si leva nell'aria immobile. È flebile, incrinata, piena di note mancanti, come un ricordo che zoppica. Eppure, sotto la sua tristezza, c'è una dolcezza antica, quasi dimenticata. Una ninnananna.\n\nNon sai perché, ma senti le palpebre farsi pesanti. Il freddo sembra attenuarsi... Ti appoggi contro la parete fredda, e per la prima volta da quando tuo padre se n'è andato, il sonno non è una caduta nell'oscurità, ma un abbandono.",
        "nextPage": 1
      },
      {
        "text": "...Ti svegli di soprassalto.\n\nNon per un rumore. Ma per la sua assenza.\n\nLa musica è finita.\n\nL'aria è immobile, pesante, e gelida. Molto più gelida di prima. E c'è un odore. Non di umidità o di rovina. È un odore pulito, chimico, sterile. L'odore di cenere fredda.\n\nI tuoi occhi si aprono nel buio. Non sei solo.",
        "nextPage": 2
      },
      {
        "text": "Una figura è in piedi dall'altra parte della stanza, immobile come una statua, stagliata contro la luce malata che filtra dall'esterno. È alta, avvolta in un mantello scuro e pesante, il cappuccio calato sul volto. Un Angelo della Cenere.\n\nIl panico ti gela il sangue nelle vene. Le lezioni di tuo padre ti urlano nella testa: Non farti vedere. Corri. Non combattere.\n\nMa sei paralizzato. Puoi solo guardare.",
        "nextPage": 3
      },
      {
        "text": "La creatura non si muove verso di te. Lentamente, con un movimento fluido e innaturale, si china. Non verso di te. Verso il carillon, che giace a terra accanto a te.\n\nUna mano pallida, quasi traslucida, emerge dal mantello. Le dita sono lunghe e sottili. Non c'è aggressività nel gesto. Solo una sorta di... curiosità meccanica. La mano si ferma a un soffio dal piccolo oggetto, come se temesse di romperlo.",
        "nextPage": 4
      },
      {
        "text": "In quel momento, il cappuccio si sposta leggermente all'indietro. Non vedi un volto. Vedi solo un frammento: la curva di una guancia, pallida come marmo, e qualcosa che riflette la luce. Una lente scura, rotonda. Ma sotto la lente, o forse al posto dell'altro occhio, vedi un bagliore debole e azzurrognolo.\n\nLa creatura emette un suono. Non è una voce. È un sibilo basso, ritmico, come l'aria che passa attraverso circuiti rovinati. E mescolato al sibilo, un sussurro distorto, elettronico, quasi inudibile. Parole spezzate. Frammenti di un'eco:\n\n«... mio... sole... devi... dormire...»\n\nÈ una voce di macchina che cerca di cantare una ninnananna. La tua ninnananna.",
        "nextPage": 5
      },
      {
        "text": "Il terrore si trasforma in un orrore così profondo da farti male al petto. Quella cosa... quella cosa ti conosce.\n\nLa figura ritrae la mano. Si rialza lentamente. Per un istante terribile, la lente scura sembra fissarti. Non c'è minaccia nel suo sguardo. Né pietà. C'è solo un vuoto vasto e incomprensibile. Un abisso.\n\nPoi, con la stessa rapidità silenziosa con cui è apparsa, si volta e si dissolve nell'ombra più profonda della stanza. Svanita.",
        "nextPage": 6
      },
      {
        "text": "Rimani solo, tremante, nel freddo pungente. L'odore di cenere svanisce lentamente. Accanto a te, il carillon giace chiuso. Non è stato un sogno.\n\nTua madre.\n\nQuello era ciò che restava di tua madre.\n\nNon ti ha attaccato. Ti ha trovato. E ti ha lasciato andare.\n\nLa domanda che ora ti brucia dentro è peggiore di qualsiasi ferita.\n\nPerché?",
        "nextPage": null
      }
    ]
  }
]
